---
kind: type
id: T:Autodesk.Revit.DB.FilterStringLess
source: html/0530fbf2-5176-ffb5-0726-718023394de2.htm
---
# Autodesk.Revit.DB.FilterStringLess

Tests whether string values from the document would sort before a certain string.

## Syntax (C#)
```csharp
public class FilterStringLess : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.